GT1/turbulent_wedge/turbulent_wedge_kO/turbulent_wedge_kO_noWF/turbulent_wedge_kO_noWF_high_l/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//simulationType laminar;
simulationType RAS;

RAS
{
    //RASModel        kEpsilon;
    //RASModel        realizableKE;
    //RASModel        RNGkEpsilon;
    //RASModel        kOmega;
    //RASModel        kOmegaSST;
    RASModel        kOmega2006;
    //RASModel        ShihQuadraticKE;	//LRN-KE Nonlinear
    //RASModel        SpalartAllmaras;
    //RASModel        LienLeschziner;	//LRN-KE
    //RASModel        LaunderSharmaKE;	//Issues with BCs and model
    //RASModel        LamBremhorstKE;	//Issues with BCs and model

/*
LRR
LamBremhorstKE
LaunderSharmaKE
LienCubicKE
LienLeschziner
RNGkEpsilon
SSG
ShihQuadraticKE
SpalartAllmaras
kEpsilon
kOmega
kOmega2006
kOmegaSST
kOmegaSSTLM
kOmegaSSTSAS
kkLOmega
qZeta
realizableKE
v2f
*/

    turbulence      on;

    printCoeffs     on;

    //alphaK2         2;

//For LaunderSharmaKE
    //C3          -0.33;
    //sigmaEps    0.76923;	//it is sigmaEps not alphaEps

}

// ************************************************************************* //
